Revit 2027 API
BuiltInFailures.FamilyFailures.CannotFindHost Property
 Couldn't find an appropriate Host. Try selecting a different Host Face or switch Placement Mode.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotFindHost { get; }
Public Shared ReadOnly Property CannotFindHost As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotFindHost {
	FailureDefinitionId^ get ();
}
static member CannotFindHost : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace